Repository: necrose99/Myaamia
Catalog: ilda_full.tmx
Source language: mia
Languages: en_us

source: nah-
en_us: Well, proper, good

source: nahaapantam-
en_us: See it clearly, see it well

source: nahaapiikasi-
en_us: The rope/thread is good, becomes good, heals

source: nahaapiikin-
en_us: Make good/heal him (rope/thread)

source: nahahtoo-
en_us: Place it well, arrange it

source: nahamamohsee-
en_us: Leave early in the morning

source: nahamamwi-
en_us: Wake up well, easily

source: nahat-
en_us: It is well (salutation)

source: nahešam-
en_us: Cut it well

source: nahihsen-
en_us: It is correct, it lies well

source: nahihtoo-
en_us: Be skilled at it, do it well

source: nahikolee-
en_us: Have a good nose, a good sense of smell

source: nahikwaatee-
en_us: Sew well

source: nahim-
en_us: Talk kindly to him, coax him

source: nahinaakosi-
en_us: (s)he is lovely, graceful

source: nahinee-
en_us: Sing

source: nahiteehee-
en_us: Be good hearted

source: nahiteeheentii-
en_us: Have good hearts towards each other, treat each other well

source: nahiteehion-
en_us: Have a proper heart, proper spirit, be wise, prudent, honor

source: nahiyohkaw-
en_us: Deal with him well

source: nahkom-
en_us: Answer him, give one's consent

source: nahohsee-
en_us: Walk well

source: nahsihkicee-
en_us: Tree swallow (Tachycineta bicolor)

source: nahsihšin-
en_us: Lie down and relax

source: nahwee-
en_us: Speak well, proper

source: nakaanakw-
en_us: middle-aged, older man

source: nakaani-
en_us: Old one, elder

source: nakaanihsen-
en_us: It is an old path, old road

source: nakaaniwi-
en_us: It is old

source: nakal-
en_us: Leave him, abandon him

source: nakamoon-
en_us: Song

source: nakatam-
en_us: Leave it, abandon it

source: nakatamaw-
en_us: Leave something of his

source: nakin-
en_us: separate him, keep him from fighting, stop him

source: nalaawahki lenasw-
en_us: Buffalo, bison (Bison bison)

source: nalaawahki pileew-
en_us: Wild turkey (Meleagris gallopavo)

source: nalaawahki pinšiw-
en_us: Bobcat (Lynx rufus)

source: nalaawahki waapinkopakat-
en_us: Lamb's quarters (Chenopodium spp.), goosefoot

source: naloomin-
en_us: Wild Rice (generic) (Zizania aquatica L.), Indian Wheat

source: nalosi-
en_us: Be gentle, tame (as an animal)

source: nameew-
en_us: Sturgeon (Acipenser oxyrinchus oxyrinchus)

source: nameewa siipiiw-
en_us: St. Mary's River (Indiana)

source: namehk-
en_us: A short time

source: napaholw-
en_us: Green Ash (Fraxinus pennsylvanica), White Ash (Fraxinus americana)

source: napaleeteemin-
en_us: Black Raspberry (Rubus occidentalis)

source: napaliahkonci
en_us: On one side

source: napil-
en_us: Common Sucker fish (Catostomus spp.)

source: natawaapam-
en_us: Look for him

source: natawaapantam-
en_us: Look for it

source: nataweelim-
en_us: Want him

source: nataweelintam-
en_us: Expect it, demand it

source: nataweewi-
en_us: Timber rattlesnake (Crotalus horridus)

source: natonamahwi-
en_us: Go hunting

source: natoneehw-
en_us: Hunt him, go after him

source: natoonam-
en_us: Catch it (as something thrown)

source: natotam-
en_us: Ask for it

source: nawaapam-
en_us: Visit him, go see him for a specific purpose

source: naweelintaakani
en_us: strategic plan, planning document

source: naweenaakii-
en_us: Lead in singing

source: naweeyohsaa-
en_us: Go first, go ahead

source: nawi
en_us: For that purpose, go and

source: nawinaal-
en_us: Chase him

source: nay-
en_us: Carry him (on back)

source: nayoo-
en_us: Carry it (on back)

source: nayosi-
en_us: Champion

source: neehi
en_us: And

source: neehiteeheelotaaki-
en_us: Social worker, social provider

source: neehpikaahkw-
en_us: Red osier dogwood (Cornus stolonifera), red willow

source: neehpikalaankwa
en_us: Mars (planet)

source: neehpiki-pihcit-
en_us: Northern Cardinal (Cardinalis cardinalis)

source: neehpikicaahkoons-
en_us: Penny, cent(s)

source: neehpikici-
en_us: Cranberry

source: neehpikicii-
en_us: Tomato

source: neehpikitaampeehsi-
en_us: Red-bellied Woodpecker (Melanerpes carolinus)

source: neehsee-
en_us: Breathe

source: neehseehpinee-
en_us: Breathing, lung disease or illness

source: neehswihsenk-
en_us: Triangle

source: neehtawi
en_us: Only, exclusively, solely, always

source: neehtohkaa-
en_us: Go alone, march alone

source: neehtoopi-
en_us: To be alone

source: neehtwapi-
en_us: Sit alone

source: neehtwiiki-
en_us: Live alone

source: neekatikaši-
en_us: Horse (Equus caballus)

source: neekatikašikaan-
en_us: Horse stable

source: neekaw-
en_us: Sand

source: neekawihki-
en_us: It is sandy

source: neekawihtan-
en_us: it is a sandy current, sandy stream

source: neekawikam-
en_us: Sandy water, Aboite River (Indiana), dunes

source: neekawikamii-
en_us: it is sandy water

source: neemawiteeheeyon-
en_us: Imagination

source: neeme-
en_us: See it

source: neenansionk-
en_us: Black Gum (Nyssa sylvatica)

source: neenimehki-
en_us: Hummingbird

source: neepihki-
en_us: Doctor

source: neepwaanki-
en_us: Teacher

source: neesÌwakamiik-
en_us: Double Creek (Oklahoma)

source: neew-
en_us: See him

source: neewe
en_us: Thank you

source: neewikolee-
en_us: Fork

source: nehs-
en_us: Capture him

source: nehtoo-
en_us: Capture it, kill it

source: nematoo-
en_us: Stand it up, set it up

source: nenaankweem-
en_us: Recognize his face

source: nenam-
en_us: Recognize it

source: nenaw-
en_us: Recognize him

source: nenohpetam-
en_us: recognize the taste of it

source: nep-
en_us: Water

source: nepaa-
en_us: Sleep, fall asleep

source: nepe-
en_us: Die, be dead

source: nepihkii-
en_us: He doctors

source: nepil-
en_us: Doctor him

source: nepohsee-
en_us: Move slow, walk slow

source: nepopahtoo-
en_us: Run slow

source: nepwaa-
en_us: Learn, be wise

source: nepwaahkaa-
en_us: Be wise, aware, come to

source: nepwaalawatam-
en_us: Be wise about it, knowledgeable about it

source: nepwaam-
en_us: Teach him

source: nepwaamiko-
en_us: Go to school

source: nepwaankii-
en_us: Teach

source: nepwaantii-
en_us: Learn from each other, teach each other

source: nepwaci-
en_us: Be slowed down by cold

source: nepwee-
en_us: Say it slowly, speak slowly

source: nepwih-
en_us: Make him slow down

source: nepwihtan-
en_us: flow slowly

source: nepwim-
en_us: Speak slowly to him

source: nepwinehkiiwaci-
en_us: Have cold hands

source: nihsepikaakan-
en_us: Whip

source: nihsopakat-
en_us: clover, white clover

source: nihswaapahee-
en_us: give birth three times, gave birth to triplets

source: niihpiil-
en_us: Bring him there, arrive with him

source: niihpikaapiikw-
en_us: red ribbon

source: niihpikan-
en_us: It is red

source: niihpikanw-
en_us: Blood

source: niihpikiciipihki-
en_us: It is a red root, Beet (Beta vulgaris)

source: niihpikiikin-
en_us: It is red cloth, paper

source: niihpikiinkwee-
en_us: Blush, have a red face

source: niihpikili-
en_us: Be red, bleed

source: niihpikilooki-
en_us: Have red skin, measles

source: niihpikiteehee-
en_us: have a bloody heart, be in a bad mood

source: niihpilokion-
en_us: Measles

source: niihpyaa-
en_us: Arrive there

source: niihsapi-
en_us: Afternoon

source: niila
en_us: I, me

source: niilaahkaal-
en_us: Throw to him

source: niilaahkaw-
en_us: Throw him

source: niilaahtoo-
en_us: Abandon it, refrain from it

source: niiloona
en_us: We, us (exclusive)

source: niim-
en_us: Carry him aloft (in hand)

source: niimaakan-
en_us: Flag

source: niime-
en_us: Carry it aloft (in hand)

source: niimi-
en_us: Dance

source: niimih-
en_us: Make him dance

source: niimihk-
en_us: Fort

source: niimihkikantaakan-
en_us: Fence

source: niimiihkam-
en_us: Dance for it

source: niimikaan-
en_us: A dance

source: niipaayohsee-
en_us: Walk at night

source: niipawi-
en_us: Stand

source: niipinw-
en_us: Summertime

source: niipinwi-
en_us: It is summer

source: niipyaahkatw-
en_us: weeping willow (Salix babylonica)

source: niiyaa-
en_us: Go there, to that place

source: niiyaaha
en_us: There about (less specific)

source: niiyaalotaw-
en_us: go to him there

source: niišakone
en_us: Two days

source: niišanwi
en_us: Twice

source: niišohkoteewi-
en_us: Have two fires, two households

source: niišonaminki akim-
en_us: Second chief

source: nimacihsin-
en_us: It lies on a slope, Mississinewa River

source: nimatee-
en_us: It stands upright, is placed upright

source: ninkotinki
en_us: Evenly, throughout, uniformly, consistently

source: nipaakaan-
en_us: Bedroom, dorm

source: nipan-
en_us: It is cold weather

source: nipeewinšii-
en_us: There is moonlight

source: nipihkahki-
en_us: It is wet, swampy ground

source: nipihs-
en_us: Lake, pond, small body of water

source: nipoop-
en_us: Soup

source: nipoopilaakan-
en_us: Soup bowl, mixing bowl

source: nipwaantiikaan-
en_us: Schoolhouse

source: nipwaayon-
en_us: Knowledge, science

source: nipwaayonikaan-
en_us: Research Center

source: noohk-
en_us: next, again

source: noohkahki-
en_us: it is soft ground, a bog

source: noohkahkisinaakan-
en_us: Slipper

source: noohkan-
en_us: it is soft

source: noohkapišaakan-
en_us: Disk (tool for softening ground)

source: noohkapišam-
en_us: Disk it (soften it, the ground)

source: noohkapišiko-
en_us: Softening the ground (disking)

source: noohkiinkwee-
en_us: Be soft corn, unripe corn

source: noohkiinkweemin-
en_us: Soft Corn

source: noohkimin-
en_us: Flour

source: noolinti-
en_us: lye hominy, boiled hominy

source: noolintiohkii-
en_us: Make hominy

source: nooliteehee-
en_us: Understand imperfectly, partially

source: nooliteeheeyonaakwat-
en_us: Be something impossible to know completely

source: noon-
en_us: Nurse, breastfeed

source: noonaakan-
en_us: Breast (female)

source: noonaakanaapow-
en_us: Milk

source: noonahiko-
en_us: To pump breastmilk

source: noonki
en_us: now

source: noont-
en_us: Nurse him, breastfeed him

source: noontaahkonaakan-
en_us: Piano, organ

source: noontaahkwaapiikahaakan-
en_us: Violin, Guitar, Fiddle

source: noontaahkwahaakan-
en_us: musical instrument

source: noontaahkwantam-
en_us: make a noise with it by mouth, play a flute

source: noontaahkwee-
en_us: Shout, make a noise

source: noontam-
en_us: Hear it, understand it

source: noontaw-
en_us: Hear him, understand him

source: noonteepakil-
en_us: Throw him outside

source: noontiaahkii-
en_us: Throw something outside

source: noontiahtoo-
en_us: Put it outside, take it out

source: noontiohsee-
en_us: Leave, get out, exit

source: noosikaan-
en_us: Sweat Lodge

source: noošonke siipiiw-
en_us: Neosho River

source: -oohkom-
en_us: Grandmother, grandma

source: -oohs-
en_us: Father (father's brothers), dad

source: -oohsem-
en_us: Grandchild

source: ooci-
en_us: Fly (Musca domestica)

source: oociaapow-
en_us: Rice soup

source: oociins-
en_us: gnat, little fly

source: oolwee-
en_us: Howl

source: oonaana
en_us: This (in reach, animate)

source: ooniini
en_us: This (in reach, inanimate)

source: oonsaaciipihk-
en_us: Carrot

source: oonsaalamon-
en_us: Bloodroot (Sanguinaria canadensis), yellow ocher

source: oonsaalamoni siipiiw-
en_us: Salamonie River (Indiana)

source: oonsaanikw-
en_us: Fox Squirrel (Sciurus niger)

source: oonsaapeehkatee-
en_us: Jerusalem artichoke (Helianthus tuberosus)

source: oonsaasiip-
en_us: Lamoine River

source: oonsaawaahkw-
en_us: Osage orange tree (Maclura pomifera)

source: oonsaawaahšii-
en_us: Have a yellow metallic shine, copper

source: oonsaawaapiikw-
en_us: yellow ribbon

source: oonsaawee-
en_us: It is yellow

source: oonsaaweekin-
en_us: It is yellow cloth, paper

source: oonsaawi-šool-
en_us: Gold

source: oonsaawicaahkw-
en_us: Brass

source: oonsaawihkihkw-
en_us: Brass Kettle

source: oonsaawihkii-
en_us: Have blond hair

source: oonsaawimin-
en_us: Lemon

source: oonsaawiminaapoohkii-
en_us: Make lemonade

source: oonsaawiminaapow-
en_us: Lemonade

source: oonsaayaankweemin-
en_us: Yellow corn

source: oonsaayopakat-
en_us: Have orange, yellow, brown leaves

source: oonsaayosaakan-
en_us: Frying pan

source: oonsaayosam-
en_us: Fry it

source: oonsaayosi-
en_us: Be yellow

source: oonseenti-
en_us: Yellow/White Poplar, Tulip tree (Liriodendron tulipifera)

source: ootoo-
en_us: Refuse to eat it, refrain from eating it

source: oowaah-
en_us: Here, located

source: oowiš-
en_us: In this direction, this way

source: oošihsaa-
en_us: Fall down

source: -pahkaam
en_us: back (of the body)

source: -pihkway-
en_us: Bladder

source: -piiwikan-
en_us: hipbone

source: -pwaam-
en_us: Thigh

source: paahkeeli-
en_us: Have an open mind, be open-minded

source: paahkinam-
en_us: Open it by hand

source: paahpaankwi-
en_us: Be crazy, unstable

source: paahpahaakan-
en_us: Key

source: paahpahaakanaapiikw-
en_us: Keychain

source: paahpaham-
en_us: Lock it

source: paahpi-
en_us: Play

source: paahpih-
en_us: Play with him

source: paahpihtoo-
en_us: Play with it

source: paahpilwee-
en_us: Be funny, make a joke

source: paahsam-
en_us: dry it (by heat)

source: paahsatoowaakan-
en_us: Giant puffball (Calvatia spp. Fries)

source: paahsw-
en_us: Dry him

source: paahtee-
en_us: It is dried (by heat or sun), dried meat

source: paakišiinkwee-
en_us: Be still, at rest

source: paakišiinkweepi-
en_us: Sit still, be at rest

source: paakocii-
en_us: Be full from eating

source: paakwiitaw-
en_us: Attack him

source: paankon-
en_us: Dry him, change his diaper

source: paankonaakan-
en_us: Diaper

source: paankosaakan-
en_us: Sugar

source: paankosaakanaahpinee-
en_us: have diabetes

source: paankosaakanaapow-
en_us: Sugar Water

source: paankosam-
en_us: Boil down till dry

source: paankwahki-
en_us: It is dry land

source: paapaahsi-
en_us: Red-headed Woodpecker (Melanerpes erythrocephalus)

source: paapahsaahk-
en_us: Center, (in the) middle (reduplicated)

source: paapahsaahkimiš-
en_us: Pignut hickory (Carya glabra)

source: paapakimin-
en_us: Hackberry

source: paapankamw-
en_us: Fox (Vulpes vulpes)

source: paapiicihkinaahkw-
en_us: Eastern musk turtle, Stinkpot (Sternotherus odoratus)

source: paapiicihši-
en_us: Goat (Capra aegagrus hircus)

source: paapincin-
en_us: Fall down

source: paaskoonti-
en_us: Ball

source: paaskoontiahaakan-
en_us: Baseball Bat

source: paaskoontiahwaa-
en_us: Play ball

source: pahkiihteenihsaahkw-
en_us: American hazelnut bush (Corylus americana)

source: pahkiihteens-
en_us: Hazelnut

source: pahkišam-
en_us: Cut a piece from it (detach)

source: pahkišw-
en_us: Cut him up (as tobacco)

source: pahkohkwaniš-
en_us: American Elm (Ulmus americana)

source: pahkonaakan-
en_us: Extracting tool

source: pahkošam-
en_us: Cut a piece from it (extract)

source: pahkošw-
en_us: Cut a piece from him, cut it off him

source: pahkwaleenaakan-
en_us: Kindling wood

source: pahkweešikan-
en_us: Bread

source: pahsaahkaahkanka
en_us: Solstice

source: pahsahaakan-
en_us: Wedge

source: pahsiikani-
en_us: Wyandot person

source: pahšikon-
en_us: Drop him, let him fall

source: pahšikonam-
en_us: Drop it, let it fall

source: pakaan-
en_us: Nut

source: pakaani siipiiw-
en_us: Elk River (West Virginia)

source: pakaanišaahkw-
en_us: hickory tree (generic)

source: pakam-
en_us: Strike him, hit him

source: pakamaakaniš-
en_us: Hackberry tree (Celtis occidentalis)

source: pakanoweehw-
en_us: Slap him on the cheek

source: pakantaakan-
en_us: Hammer

source: pakantam-
en_us: Strike it, hit it

source: pakii-
en_us: Crack nuts

source: pakitahaakan-
en_us: Lacrosse stick

source: pakitaham-
en_us: play lacrosse

source: pakitahamahk-
en_us: Lacrosse field

source: pakitam-
en_us: Throw it away, discard it

source: pakitaw-
en_us: Throw something at him

source: pakiteehšim-
en_us: throw him down

source: pakwaahkon-
en_us: Lacrosse ball

source: pakwanteehwi-
en_us: Put on/wear a belt, cinch one's clothing

source: pakwantion-
en_us: Belt

source: palakin-
en_us: Peel him, husk him

source: palehkaamee-
en_us: Be brave

source: palehtaw-
en_us: mishear him

source: pankihkwaašiko-
en_us: Go fishing, be fishing (with a line and pole)

source: pankihkwašikw-
en_us: Angler

source: pankihtamw-
en_us: Parakeet (Conuropsis carolinensis), parrot

source: pankihšin-
en_us: West, sunset

source: pankitee-
en_us: It bursts from heat, explodes, pops

source: papaakanti-
en_us: Sunfish (Centrarchidae)

source: papakimin-
en_us: Blackhaw (fruit)

source: papakimišaahkw-
en_us: Blackhaw tree (Viburnum prunifolium)

source: papampahtoo-
en_us: Jog, run

source: papankihšin-
en_us: It is thin and flat, pancake

source: papankišaapiikat-
en_us: Flat threads, flat strings, ribbons

source: papantion-
en_us: Lightning

source: papikwan-
en_us: Gun

source: pasakwaapow-
en_us: Molasses

source: pasakwan-
en_us: It is sticky

source: pasekwii-
en_us: Get up, arise

source: patahkahaakan-
en_us: printer

source: patahkaham-
en_us: print it

source: patahkin-
en_us: Hold him down by hand

source: peehkaamihki-
en_us: it is good soil, fertile land

source: peehkahki-
en_us: it is good land

source: peehkasi-
en_us: Bloom

source: peehkat-
en_us: It is pretty, good

source: peehkeelim-
en_us: Think highly of him, find him beautiful

source: peehkeelintam-
en_us: Think highly of it, find it beautiful

source: peehki
en_us: good, morally, well

source: peehkiciih-
en_us: Dress him well

source: peehkiciinaakosi-
en_us: Look nice, dress well

source: peehkihkaa-
en_us: Work well

source: peehkihkanawee-
en_us: Travel on a good trail

source: peehkihpenal-
en_us: Do well to him, treat him good, bless him

source: peehkihsen-
en_us: It is a good trail, good trip

source: peehkihtam-
en_us: Like to hear it

source: peehkiihs-
en_us: Brant, farm goose

source: peehkikalol-
en_us: say good words to him, speak pleasingly to him

source: peehkikwaatam-
en_us: Sew it nicely, prettily

source: peehkikwaatee-
en_us: Be sewn prettily

source: peehkinaakosi-
en_us: Be generous, kind

source: peehkisam-
en_us: Cook it well

source: peehkisi-
en_us: Pretty, beautiful, cute

source: peehkitaw-
en_us: Make it nice for him

source: peehkitee-
en_us: it is cooked well, nicely

source: peehkiteehee-
en_us: Be good hearted, friendly, have a good disposition

source: peehkiteeheelotaw-
en_us: Be fond of him, well disposed towards him

source: peehkitoo-
en_us: adorn it, make it nice

source: peehkišinaakosi-
en_us: Be good-natured, of good manners, courteous

source: peekamiiki siipiiw-
en_us: Missouri River

source: peekihtanki siipiiw-
en_us: Pecatonica River (Illinois)

source: peekitamink-
en_us: Trash, discard it, throw it away

source: peekiti-
en_us: Fart

source: peemak-
en_us: Never, not (future sense)

source: peemineeta kiilhswa
en_us: Moon phases

source: peepahkwilaakii-
en_us: Black Ash (Fraxinus nigra)

source: peepakihki-
en_us: Jew, Jewish person

source: peepakikoli-
en_us: Paddlefish (Polyodon spathula)

source: peepankihšileeta ahsen-
en_us: Shale

source: peepanšiinkwi-
en_us: White bass (Morone chrysops), White perch (Morone americana)

source: peepeehkwaahki-
en_us: It is land of mounds

source: peepicikoleehši-
en_us: Rose-breasted Grosbeak (Pheucticus ludovicianus)

source: peepicinehki-
en_us: Mole

source: peepincihs-
en_us: Spark

source: peepookanteehši-
en_us: Wren (genus Troglodytes)

source: peesakwaan-
en_us: Wax

source: peewaaleewaataweeyon-
en_us: Peoria language

source: peewaali-
en_us: Peoria person

source: peewaaliaatawee-
en_us: Speak the Peoria language

source: peewaalionki
en_us: Peoria lands; Paola, Kansas

source: peeweeyoci-
en_us: Peach

source: peeweeyocita moohsi-
en_us: Caterpillar

source: peewiiyocaahkw-
en_us: Peach tree (Prunus persica)

source: peeyankihši-
en_us: Piankashaw person

source: peešiaanikop-
en_us: Hickory (generic)

source: pehcihtoo-
en_us: Mistake it for something else

source: pehcikwaatam-
en_us: Sew it wrongly

source: pehcim-
en_us: Accuse him by mistake

source: pehcinaw-
en_us: Mistake him for someone else

source: pehcipowi-
en_us: Drink the wrong thing, drink mistakenly

source: pehcišileni-
en_us: Make a mistake, act in error

source: pehki-
en_us: Be a stranger, outsider, foreigner

source: pehkwaatam-
en_us: Belch, burp

source: pehtahotoo-
en_us: tie it wrongly

source: pehtahw-
en_us: Hit him by mistake

source: pehtahwi-
en_us: Hit oneself by mistake

source: pehtakintam-
en_us: Count it wrong

source: pehtantam-
en_us: Eat it by mistake

source: pehtawal-
en_us: Lead him wrong

source: pehtawatoo-
en_us: carry it by mistake

source: pehtehtam-
en_us: Hear it wrongly

source: pehtehtaw-
en_us: hear him wrongly

source: pehtešwi-
en_us: Cut oneself by mistake

source: pehtišw-
en_us: Accidentally cut him, mistakenly cut him

source: pehtwee-
en_us: Say the wrong thing, make an error in speaking

source: pelakii-
en_us: Be healthy, healed, recover, made whole, be liberated

source: pelakiih-
en_us: Cure him, heal him

source: pelakiihiwee-
en_us: Be a nurse, healer

source: pelakiitoo-
en_us: Heal it

source: pemaahkii-
en_us: Throw something, throw it

source: pemahwi-
en_us: Paddle a canoe

source: pemawatoo-
en_us: Carry it along

source: pemeelintam-
en_us: Respect it, heed it

source: pemehkawee-
en_us: Leave footprints, track of one's species

source: pemicimee-
en_us: Swim along

source: pemihkanawee-
en_us: Walking, traveling on a trail

source: pemihtan-
en_us: it flows along, current

source: peminee-
en_us: Go along dying

source: pemink-
en_us: Above, up, upstairs

source: pemitaacimwi-
en_us: Crawl

source: pemitaahkwihsen-
en_us: It (tree) lies across, forms a bridge

source: pempaali-
en_us: Walk, walk along, travel along

source: pemw-
en_us: Shoot him

source: penaal-
en_us: give birth to him/her

source: penahkwah-
en_us: Comb his hair

source: penahkwee-
en_us: Comb one's own hair

source: penahw-
en_us: Knock him down, off

source: penenam-
en_us: Take it down, take it off (as in a hat)

source: peni-
en_us: Give birth

source: pepoonwee-
en_us: I am old, of a certain age, winters

source: pepyaahšin-
en_us: Lie alongside

source: pesehkam-
en_us: Wear shoes, put on shoes

source: pesentam-
en_us: Listen to it, obey it

source: pesentaw-
en_us: Listen to him, obey him, pay attention to him

source: pesikonam-
en_us: Take it off

source: pihci
en_us: mistakenly, in error

source: pihci-
en_us: Small Bird (sparrow size and smaller)

source: pihkatee-
en_us: It blooms, flower

source: pihkin-
en_us: It is different, foreign

source: pihkontee-
en_us: It is dark, night

source: pihkontee-kiilhsw-
en_us: Moon

source: pihkonteehki-
en_us: It is dark land, a dark place

source: pihkwaahk-
en_us: Mound

source: pihšaahkalw-
en_us: Flute, cane

source: piici-
en_us: Stink

source: piicihsakat-
en_us: Peppermint (Mentha Ã piperita), sweet everlasting (Pseudognaphalium obtusifolium), pennyroyal (Hedeoma pulegioides)

source: piicihsin-
en_us: It stinks

source: piicileehsee-
en_us: breath stinks

source: piihsalet-
en_us: It is moldy

source: piihsihkikamii-
en_us: It is foamy water

source: piikahki-
en_us: Be muddy ground

source: piikamihtanwi siipiiw-
en_us: Great Kanahwa River (West Virginia)

source: piil-
en_us: Bring him

source: piimihkociihsi-
en_us: Cocoon

source: piiminahkwee-
en_us: make cordage

source: piiminihkwaan-
en_us: Cordage

source: piintaloon-
en_us: Quiver

source: piintikaahkii-
en_us: Throw in, toss in

source: piintikal-
en_us: Take him inside, lead him in

source: piintikatoo-
en_us: Bring it in, place it inside

source: piintikii-
en_us: Enter (a room or building)

source: piipahtoo-
en_us: Come running

source: piit-
en_us: pizza

source: piitaahkaw-
en_us: throw to/at him

source: piitaamwi-
en_us: Flee in this direction

source: piitaw-
en_us: Bring it for him, to him

source: piitilaan-
en_us: It rains, it is raining

source: piitilaanoons-
en_us: Barn swallow (Hirundo rustica), Cliff swallow (Petrochelidon pyrrhonota)

source: piitoo-
en_us: Bring it

source: piiwahaakan-
en_us: Hairbrush

source: piiwaham-
en_us: brush it, brush it off

source: piiwahw-
en_us: Brush him
